tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python3"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Cross-platform application and UI framework
brew "qt"
# Manage compile and link flags for libraries
brew "pkg-config"
# Website copier/offline browser
brew "httrack"
# Interactive computing in Python
brew "ipython"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# High-level interpreted language for numerical computing
brew "octave"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Python bindings for v5 of Qt
brew "pyqt"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
brew "zsh-completions"

cask "android-platform-tools"
cask "karabiner-elements"
cask "geany"
cask "gimp"

mas "au.id.haroldchu.mac.Bandwidth", id: 490461369
mas "com.amazon.Kindle", id: 405399194
mas "com.if.Amphetamine", id: 937984704
mas "com.ookla.speedtest-macos", id: 1153157709
mas "com.readitlater.PocketMac", id: 568494494
mas "com.shazam.mac.Shazam", id: 897118787
mas "com.tinyspeck.slackmacgap", id: 803453959
mas "com.unsplash.Wallpapers", id: 1284863847
mas "com.ushareit.SHAREit", id: 1040029915
mas "desktop.WhatsApp", id: 1147396723
mas "jp.ogihara.typist", id: 415166115
mas "net.shinyfrog.bear", id: 1091189122

